#include <stdio.h>
//操作符
//+   -  *  /  %
//1.除了%操作符之外，其他都可用于整数和浮点数
//2.对于/操作符如果两个操作符都为整数，执行整数除法，而只要有浮点数执行的就是浮点数除法

//位移操作符
//<<左移操作符
//>>右移操作符
//int main()
//{
//	// >>--右移操作符:
//	//移动的是二进制
//	//1.算数右移：右边丢弃，左边补原符号位
//	//2.逻辑右移：右边丢弃，左边补0
//	int a = 16;//a:0000 0000 0000 0000 0000 0000 0001 0000
//	int b = a >> 1;
//	return 0;
//}

//int main()
//{
//	int a = -1;
//	整数的二进制表示有：原码，反码，补码
//	存储到内存的是补码
//	1000 0000 0000 0000 0000 0000 0000 0001  原码
//	1111 1111 1111 1111 1111 1111 1111 1110  反码
//	1111 1111 1111 1111 1111 1111 1111 1111  补码
//	int b = a >> 1;
//	printf("%d\n", b);
//	return 0;
//}

//int main()
//{
//	int a = 5;
//	int b = a << 1;
//	//0000 0000 0000 0000 0000 0000 0000 0101  :5
//	//0000 0000 0000 0000 0000 0000 0000 1010  :
//	return 0;
//}

//注意：对于位移运算符，不要移动负数位，这个是标准定义的
//int num=10;
//num>>-1//error



//位操作符（按2进制）
// &:按位与
// |:按位或
// ^:按位异或
//注意：他们的操作数必须是整数

//位操作&
//int main()
//{
//	int a = 3;
//	int b = 5;
//	int c = a & b;
//	//    0000 0000 0000 0000 0000 0000 0000 0011  :3
//	//    0000 0000 0000 0000 0000 0000 0000 0101  :5
//	//a&b:0000 0000 0000 0000 0000 0000 0000 0001  :1
//	//&:在2进制中两数相同位都为0 则 & 后仍为0
//	//&:在2进制中两数相同位中存在0 则 & 后为0
//	//&:在2进制中两数相同位都为1 则& 后为1
//	printf("%d", c);//结果打印是1
//	return 0;
//}

//位操作 |
//int main()
//{
//	int a = 3;
//	int b = 5;
//	int c = a | b;
//	printf("%d", c);
//	//    0000 0000 0000 0000 0000 0000 0000 0011  :3
//	//    0000 0000 0000 0000 0000 0000 0000 0101  :5
//	//a|b:0000 0000 0000 0000 0000 0000 0000 0111  :7
//	//按位或 |：在2进制中两数有1则 | 后为1
//
//	return 0;
//}

//按位异或 ^
//int main()
//{
//	int a = 3;
//	int b = 5;
//	int c = a ^ b;
//	printf("%d", c);
//	//    0000 0000 0000 0000 0000 0000 0000 0011  :3
//	//    0000 0000 0000 0000 0000 0000 0000 0101  :5
//	//a^b:0000 0000 0000 0000 0000 0000 0000 0110  :6
//	//按位异或：相同为0，相异为1
//	return 0;
//}

//不能创建临时变量（第三个变量），实现两个数的交换
//int mian()
//{
//	int a = 3;
//	int b = 5;
//	int tmp = 0;//临时变量
//	tmp = a;
//	a = b;
//	b = tmp;
//	printf("%d%d", a, b);
//	return 0;
//	//含有临时变量
//}

//加减法交换两数的值(但可能会溢出)
//int main()
//{
//	int a = 3;
//	int b = 5;
//	a = a + b;
//	b = a - b;
//	a = a - b;
//	printf("%d\n%d", a, b);
//	return 0;
//}

//异或算法
//a      011          a       110          a       110
//b      101  ---->   b       101----->    b       011
//a=a^b :110          b=a^b   011          a=a^b   101
//int main()
//{
//	int a = 3;
//	int b = 5;
//	a = a ^ b;
//	b = a ^ b;
//	a = a ^ b;
//	printf("%d\n%d\n", a, b);
//	return 0;
//}

//求一个整数存储在内存中的二进制中1的个数
//int main()
//{
//	int num = 0;
//	int count = 0;
//	scanf_s("%d", &num);//-1 error不能算负数
//	//统计num的补码有几个1
//	while (num)
//	{
//		if (num % 2 == 1)
//		{
//			count++;
//		}
//		num = num / 2;
//	}
//	printf("%d\n", count);
//	return 0;
//}

//复合赋值符
//+=  -=   *=   /=   %=   >>=  <<=  &=  |=  ^=
//int main()
//{
//	int a = 10;
//	a = a + 2;
//	a += 2;
//	a = a & 1;
//	a &= 1;
//	return 0;
//}

//单目操作符
//!  逻辑反操作
//-  负值
//+  正值
//&  取地址
//sizeof 操作数的类型长度（以字节为单位）
// ~  对一个数的二进制按位取反
//--   ++  前置，后置--  ++
//*   简介访问操作符（解引用操作符）
//（类型）  强制类型转化

//解引用操作符
//int main()
//{
//	int a = 10;
//	int* p = &a;//取地址操作符
//	*p = 20;//解引用操作符
//	printf("%d", a);
//	return 0;
//}

//sizeof
//int main()
//{
//	int a = 10;
//	char c = 'r';
//	char* p = &c;
//	int arr[10] = { 0 };
//	//sizeof 计算的变量所占内存空间的大小，单位是字节
//	printf("%d\n", sizeof(a));//4
//	printf("%d\n", sizeof(int));//int类型占4个字节
//	printf("%d\n", sizeof(c));//1
//	printf("%d\n", sizeof(char));//char类型占1个字节
//	printf("%d\n", sizeof(p));//4
//	printf("%d\n", sizeof(char*));
//	printf("%d\n", sizeof(arr));//40
//	printf("%d\n", sizeof(int[10]));
//	return 0;
//}

//short类型
//int main()
//{
//	short s = 0;//short类型占2个字节
//	int a = 10;
//	printf("%d\n", sizeof(s = a + 5));//2
//	printf("%d\n", s);//0,说明sizeof里面进行的计算只仅限于sizeof里面
//	return 0;
//}


//~按位取反
//int main()
//{
//	int a = 0;
//	printf("%d\n", ~a);//-1
//	//0000 0000 0000 0000 0000 0000 0000 0000  a的补码
//	//1111 1111 1111 1111 1111 1111 1111 1111 按位取反后所得的  补码，     内存中存储的是补码，打印的是原码
//	//1111 1111 1111 1111 1111 1111 1111 1110 按位取反后所得的  反码
//	//0000 0000 0000 0000 0000 0000 0000 0001 按位取反后所得的  原码
//	return 0;
//}

//将2进制中1011中的0变为1
int main()
{
	int a = 11;
	a=a|(1)
}