#include <stdio.h>
//前置++，先++，后使用
//后置++，先使用，再++
//int main()
//{
//	int a = 10;
//	//printf("%d", ++a);
//	printf("%d\n", a++);
//	printf("%d", a);
//	return 0;
//}

//逻辑操作符
//&&   逻辑与
//||   逻辑或

//区别
//1&2   ----->0         1|2    ---->3
//1&&2  ----->1         1||2   ---->1

//判断程序输出的结果是什么
//int main()
//{
//	int i = 0, a = 0, b = 2, c = 3, d = 4;
//	i = a++ && ++b && d++;
//	//a++后置++，先用后加，即运算时a=0,为假。。
//	//&&左边算出的为假，就不用算右边的了，
//	//所以++b不用计算，所以b=2
//	printf("a=%d\nb=%d\nc=%d\nd=%d\n", a, b, c, d);//1,2,3,4
//}

//int main()
//{
//	int i = 0, a = 0, b = 2, c = 3, d = 4;
//	i = a++ || ++b || d++;
//	//||左边为真，右边就不用算了
//	//a++||后变为1
//	//++b-->3,3||为真,d++不用算
//	printf("a=%d\nb=%d\nc=%d\nd=%d\n", a, b, c, d);//1，3，3，4
//	return 0;
//}

//条件操作符
//exp1?exp2:exp3
//int main()
//{
//	int a = 0;
//	int b = 0;
//	if (a > 5)
//		b = 3;
//	else
//		b = -3;
//	//与上面的式子等价：b=(a>5?3:-3)
//	return 0;
//}

//int main()
//{
//	int a = 10;
//	int b = 20;
//	int max = 0;
//	if (a > b)
//		max = a;
//	else
//		max = b;
//	//max=(a>b?a:b);
//	return 0;
//}

//逗号表达式
//exp1,exp2,exp3,...expn
//逗号表达式，就是用逗号隔开的多个表达式。逗号表达式，从左向右依次执行。整个表达式的最后结果时表达式是结果


//下标引用、函数调用和结构成员
//1.[]下标引用操作符
//操作数：一个数组名+一个盈缩至
//int arr[10]={0};
//2.（）函数调用操作符接受一个或多个操作符：第一个操作数是函数名，剩余的操作数就是传递函数的参数


//int get_max(int x, int y)
//{
//	return x > y ? x : y;
//}
//int main()
//{
//	int a = 10;
//	int b = 20;
//	//调用函数的时候（）就是函数调用操作符
//	int max = get_max(a, b);
//	printf("max=%d\n", max);
//	return 0;
//}

//访问一个结构的成员
//  .结构体.成员名
// ->结构体指针->成员名

//创建一个结构体类型-struct Stu
//struct Stu
//{
//	char name[20];
//	int age;
//	char id[20];
//};
//int main()
//{
//	int a = 10;
//	//使用struct Stu这个类型创建了一个学生对象s1，并初始化
//	struct Stu s1 = { "张三",20,"201315" };
//	struct Stu* ps = &s1;
//	printf("%s\n", ps->name);
//	printf("%d\n", ps->age);
//	//结构体指针->成员名
//	printf("%s\n", s1.name);
//	printf("%d\n", s1.age);
//	printf("%s\n", s1.id);
//	////结构体变量.成员名
//}

//整型提升：C的整型算数运算总是缺少整型类型的精度进行的，为了获得这个精度
//         表达式的字符和短整型操作数在使用之前被转化为普通整形
//整型提升是按照变量的数据类型的符号为来提升的
int main()
{
	char a = 3;//占1个字符
	//0000 0000 0000 0000 0000 0000 0000 0011
	char b = 127;
	//0000 0000 0000 0000 0000 0000 0111 1111 
	//a和b如何相加
	//00000011
	//             整型提升，按符号位补位
	//01111111
	char c = a + b;
	printf("%d\n", c);
	return 0;
}

//算数转化
//如果某个操作符的各个操作数属于不同的类型，那么除非其中一个操作数的转化为另一个操作数的类型，
//否则操作就无法进行。下面的层次体系称为寻常算数转换
//long double
//double
//float
//unsigned long int 
//long int
//unsigned int
//int
//如果某个操作数的类型在上面这个列表中排名较低，南无首先转换为另一个操作数的类型后执行运算
 
//float f=3.14;
//int num=f;//隐式转换，会有精度丢失

//问题表达式
//a*b+c*d+f*g
//计算机运算顺序可能会有
//a*b, c*d,  a*b+c*d,  e*f   ,a*b+c*d+e*f
//a*b, c*d,e*f

//c+--c